Revit 2027 API
BuiltInFailures.FormFailures.FormCreationInvalidGeomCombination Property
 Cannot remake form that is currently cut or joined to other geometry. Please uncut or unjoin first.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormCreationInvalidGeomCombination { get; }
Public Shared ReadOnly Property FormCreationInvalidGeomCombination As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormCreationInvalidGeomCombination {
	FailureDefinitionId^ get ();
}
static member FormCreationInvalidGeomCombination : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace